{"format": "layers-model", "generatedBy": "keras v2.9.0", "convertedBy": "TensorFlow.js Converter v3.19.0", "modelTopology": {"keras_version": "2.9.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_22", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null], "dtype": "float32", "sparse": false, "ragged": false, "name": "embedding_12_input"}}, {"class_name": "Embedding", "config": {"name": "embedding_12", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 30001, "output_dim": 64, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": true, "input_length": null}}, {"class_name": "Dropout", "config": {"name": "dropout_23", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_24", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_24", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_25", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_25", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 32, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}}, {"class_name": "Dense", "config": {"name": "dense_24", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_24", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_25", "trainable": true, "dtype": "float32", "units": 6, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"loss": {"class_name": "CategoricalCrossentropy", "config": {"reduction": "auto", "name": "categorical_crossentropy", "from_logits": false, "label_smoothing": 0.0, "axis": -1}}, "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "categorical_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0010000000474974513, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "bidirectional_24/forward_lstm_24/lstm_cell_73/kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_24/forward_lstm_24/lstm_cell_73/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_24/forward_lstm_24/lstm_cell_73/bias", "shape": [256], "dtype": "float32"}, {"name": "bidirectional_24/backward_lstm_24/lstm_cell_74/kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_24/backward_lstm_24/lstm_cell_74/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_24/backward_lstm_24/lstm_cell_74/bias", "shape": [256], "dtype": "float32"}, {"name": "bidirectional_25/forward_lstm_25/lstm_cell_76/kernel", "shape": [128, 128], "dtype": "float32"}, {"name": "bidirectional_25/forward_lstm_25/lstm_cell_76/recurrent_kernel", "shape": [32, 128], "dtype": "float32"}, {"name": "bidirectional_25/forward_lstm_25/lstm_cell_76/bias", "shape": [128], "dtype": "float32"}, {"name": "bidirectional_25/backward_lstm_25/lstm_cell_77/kernel", "shape": [128, 128], "dtype": "float32"}, {"name": "bidirectional_25/backward_lstm_25/lstm_cell_77/recurrent_kernel", "shape": [32, 128], "dtype": "float32"}, {"name": "bidirectional_25/backward_lstm_25/lstm_cell_77/bias", "shape": [128], "dtype": "float32"}, {"name": "dense_24/kernel", "shape": [64, 64], "dtype": "float32"}, {"name": "dense_24/bias", "shape": [64], "dtype": "float32"}, {"name": "dense_25/kernel", "shape": [64, 6], "dtype": "float32"}, {"name": "dense_25/bias", "shape": [6], "dtype": "float32"}, {"name": "embedding_12/embeddings", "shape": [30001, 64], "dtype": "float32"}]}]}